;*------------------------------------------------------------------------------
; 割り込み等でレジスタの内容を保存する
; @PARAM void
; @BREAK void
; @RETURN void
;*------------------------------------------------------------------------------

.macro registerSave
		php
		pha
		txa
		pha
		tya
		pha
.endmacro

;*------------------------------------------------------------------------------
; 割り込み等終了時にレジスタの内容をリストアする
; @PARAM void
; @BREAK void
; @RETURN void
;*------------------------------------------------------------------------------

.macro registerLoad
		pla
		tay
		pla
		tax
		pla
		plp
.endmacro